RedditClone/app/controllers/subs_controller.rb

  def show
    @sub = Sub.find(params[:id])
    @posts = Post.where(sub_id: @sub.id)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]

  def index
    @subs_not_from_user = Sub.where.not(user_id: current_user.id)
---
SELECT "subs".* FROM "subs" WHERE "subs"."user_id" != $1  [["user_id", 2]]

  def update
    @sub = current_user.subs.find(params[:id])

    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "im taking the queen"], ["updated_at", "2018-10-23 21:13:18.059984"], ["id", 2]]