RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "_RC91QHSTxisYSc4krupvg"], ["updated_at", "2018-10-23 20:13:58.660110"], ["id", 1]]
---
  def reset_session_token
    self.session_token = User.generate_session_token
    self.save